jagoanpilot/ESP32/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
// === Data state ===
// CRITICAL real-time data: use atomic (lock-free, no mutex needed)
std::atomic<int32_t> atomicAmpereRaw{0};    // Store as int (x10) for atomic
std::atomic<int32_t> atomicVoltsRaw{0};     // Store as int (x10) for atomic
std::atomic<int32_t> atomicPowerRaw{0};     // Store as int for atomic
std::atomic<int> atomicRPM{0};
std::atomic<int> atomicSpeed{0};
std::atomic<float> atomicOdometerKm{0.0f};
std::atomic<VehicleMode> atomicMode{MODE_PARK};  // Thread-safe mode
std::atomic<bool> atomicRegenActive{false};
std::atomic<TransportMode> transportMode{TRANSPORT_BLE};  // Thread-safe transport mode

static uint8_t liveDataResponseBuffer[24] = {0};
static uint8_t liveDataResponseFrames = 0;
static bool liveDataResponseCollecting = false;

// Non-critical data: protected by mutex (no volatile needed - mutex provides memory barrier)
int valRPM = 0;
int valSpeed = 0;
float valVolts = 0.0f;
float valAmpere = 0.0f;
float valPower = 0.0f;

Preferences preferences;
int valSOC = FORCED_BATTERY_PERCENT;
std::atomic<bool> isInjectorEnabled{false}; // Atomic: accessed from BLE/WiFi (Core 1) + CAN task (Core 0)
bool currentTwaiModeNormal = false;          // TWAI mode: false=LISTEN_ONLY, true=NORMAL
unsigned long lastPeriodicSave = 0;  // Last periodic backup timestamp
bool shutdownSaved = false;          // Flag to prevent multiple shutdown saves
std::atomic<bool> canDataReady{false};  // Atomic: true after first valid SOC received from CAN

// NVS-safe write helpers (Fix #2: wrap all NVS writes in mutex)
static inline void nvsWriteInt(const char* key, int val) {
  if (xSemaphoreTake(nvsMutex, pdMS_TO_TICKS(50)) == pdTRUE) {
    preferences.putInt(key, val);
    xSemaphoreGive(nvsMutex);
  }
}
static inline void nvsWriteBool(const char* key, bool val) {
  if (xSemaphoreTake(nvsMutex, pdMS_TO_TICKS(50)) == pdTRUE) {
    preferences.putBool(key, val);
    xSemaphoreGive(nvsMutex);
  }
}
static inline void nvsWriteString(const char* key, const char* val) {
  if (xSemaphoreTake(nvsMutex, pdMS_TO_TICKS(50)) == pdTRUE) {
    preferences.putString(key, val);
    xSemaphoreGive(nvsMutex);
  }
}

int valCtrlTemp = 0;
int valMotorTemp = 0;
int valBattTemp = 0;

// Handle Write Requests from Flutter
class MyCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic *pCharacteristic) {
#if defined(ESP_IDF_VERSION) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
      String value = pCharacteristic->getValue();
#else
      std::string rxValue = pCharacteristic->getValue();
      String value = String(rxValue.c_str());
#endif

      if (value.length() > 0) {
        // Simple command parser
        // Cmd: "INJECT:1" -> Enable
        // Cmd: "INJECT:0" -> Disable
        if (value.startsWith("INJECT:")) {
           char cmdVal = value.charAt(7);
           if (cmdVal == '1') {
             isInjectorEnabled.store(true, std::memory_order_release);
             nvsWriteBool("inj", true);
           } else if (cmdVal == '0') {
             isInjectorEnabled.store(false, std::memory_order_release);
             nvsWriteBool("inj", false);
           }
        }
        // Cmd: "WIFI:ON" -> Switch to WiFi mode
        else if (value.startsWith("WIFI:ON")) {
          Serial.println("[BLE] Switch to WiFi mode requested");
          transportMode.store(TRANSPORT_WIFI, std::memory_order_release);
          // Mode saved by loop() auto-save
        }
      }
    }
};

// strModeBuffer and isBraking replaced by atomicMode

// All below protected by dataMutex (no volatile needed)
uint16_t valCells[23] = {0};
uint8_t valCellTemps[5] = {0};

float valRemainingCapacity = 0.0f;
float valFullCapacity = 0.0f;

int valSOH = 0;
uint16_t valCycleCount = 0;

uint16_t valHighestCellVolt = 0;
uint8_t  valHighestCellNum  = 0;
uint16_t valLowestCellVolt  = 0;
uint8_t  valLowestCellNum   = 0;
uint16_t valAvgCellVolt     = 0;

uint8_t valMaxTemp = 0;
uint8_t valMaxTempCell = 0;
uint8_t valMinTemp = 0;
uint8_t valMinTempCell = 0;

uint8_t valBalanceMode = 0;
uint8_t valBalanceStatus = 0;
uint8_t valBalanceBits[4] = {0};

uint16_t rawCurrentHex = 0;
uint16_t rawVoltageHex = 0;
uint16_t rawSOCHex = 0;
char rawBalanceHexBuffer[24] = "00 00 00 00 00 00";

// Charger data (mutex-protected)
float valChargerVoltage = 0.0f;
float valChargerCurrent = 0.0f;
uint8_t valChargerStatus = 0;
bool chargerConnected = false;
unsigned long lastChargerMsg = 0;

// BMS Info (mutex-protected)
bool bmsChargingFlag = false;        // 0x0AB40D09 byte[0]=1 when charging
bool oriChargerDetected = false;     // 0x10261041 only from ORI charger
unsigned long lastOriChargerMsg = 0;
char bmsHwVersion[8] = "";           // 0x0A750D09 "H:v21"
char bmsFwVersion[8] = "";           // 0x0A760D09 "F:v23"

std::atomic<uint32_t> canMessagesPerSec{0};  // Atomic: written by CAN task (Core 0), read by Comm task (Core 1)
uint32_t canMsgCount = 0;       // Only used in CAN task (Core 0)
uint32_t lastSecond = 0;        // Only used in CAN task (Core 0)

unsigned long lastLEDBlink = 0;
bool ledState = false;

unsigned long heartbeatCounter = 0;

// === BLE TX state (BLE task only) ===
static char bleTxBuf[2200];        // Full JSON buffer
static char webSnapshotBuf[768];   // Compact full-state snapshot for Web Bluetooth read()
static uint16_t bleTxLen = 0;
static uint16_t bleTxOffset = 0;
static bool bleTxInProgress = false;
static uint32_t lastFastSend = 0;  // Last fast update time
static uint32_t lastSlowSend = 0;  // Last slow update time
static uint32_t lastWebSnapshotRefresh = 0;

// =============================================
// CAN PARSING (runs on Core 0)
// =============================================
void handleCANMessage(twai_message_t &msg) {
  uint32_t id = msg.identifier;
  canDataReady.store(true, std::memory_order_release);

  // REMOVED: Aggressive prefix filter to prevent missing unknown IDs
  // uint8_t prefix = id >> 24;
  // if (prefix != 0x0A && prefix != 0x0E && prefix != 0x18 && prefix != 0x10) return;



  // Control live-data response (0x3FE): 3 x 8-byte frames containing status, voltage, current, RPM, etc.
  // Re-gen flag is carried in frame 2, byte 6 (B22 bit7), not in the raw 0x0A010810 mode byte.
  if (id == 0x3FE && msg.data_length_code == 8) {
    const uint8_t frame0Header[4] = {0x09, 0x55, 0xAA, 0xAA};

    if (memcmp(msg.data, frame0Header, sizeof(frame0Header)) == 0) {
      memset(liveDataResponseBuffer, 0, sizeof(liveDataResponseBuffer));
      liveDataResponseFrames = 0;
      liveDataResponseCollecting = true;
    }

