jagoanpilot/ESP32/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
    if (!liveDataResponseCollecting) {
      return;
    }

    memcpy(&liveDataResponseBuffer[liveDataResponseFrames * 8], msg.data, 8);
    liveDataResponseFrames++;

    if (liveDataResponseFrames >= 3) {
      uint8_t statusBits = liveDataResponseBuffer[22];
      atomicRegenActive.store((statusBits & 0x80) != 0, std::memory_order_release);
      liveDataResponseFrames = 0;
      liveDataResponseCollecting = false;
    }

    return;
  }

  // Controller basic
  if (id == 0x0A010810 && msg.data_length_code >= 8) {
    // OPTIMIZATION: Update Atomic variables IMMEDIATELY (No Mutex needed)
    int rpm = msg.data[2] | (msg.data[3] << 8);
    int speed = (int)(rpm * 0.1033f);
    atomicRPM.store(rpm, std::memory_order_release);
    atomicSpeed.store(speed, std::memory_order_release);

    // Parse mode and update atomic (no mutex needed for atomic)
    uint8_t m = msg.data[1];
    uint8_t modeByte = m & 0x7F;
    VehicleMode newMode = MODE_PARK;  // Default for unknown modes
    bool regenBit = (m & 0x80) != 0;

    // Controller mode byte uses the legacy values already present in the project.
    // bit7 is reserved for regeneration flag, so we strip it before decoding the mode,
    // then capture the regen bit separately for the dashboard display.
    if (modeByte == 0x00) newMode = MODE_PARK;
    else if (modeByte == 0x61) newMode = MODE_CHARGING;
    else if (modeByte == 0x70) newMode = MODE_DRIVE;
    else if (modeByte == 0x50 || modeByte == 0xF0 || modeByte == 0x30 || modeByte == 0xF8) newMode = MODE_REVERSE;
    else if (modeByte == 0x72 || modeByte == 0xB2) newMode = MODE_BRAKE;
    else if (modeByte == 0xB0) newMode = MODE_SPORT;
    else if (modeByte == 0x78 || modeByte == 0x08) newMode = MODE_STAND;
    // Unknown modes default to MODE_PARK (already set above)

    atomicMode.store(newMode, std::memory_order_release);
    atomicRegenActive.store(regenBit, std::memory_order_release);

    // Update non-critical data with Mutex
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valRPM = rpm;
      valSpeed = speed;
      valCtrlTemp = msg.data[4];
      valMotorTemp = msg.data[5];
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Votol controller speed + odometer frame (0x9026105A)
  // Example layout from the documentation: bytes 0..1 = odometer (little-endian, km), byte 5 = speed (km/h)
  // This sensor frame is commonly used as the source for odometer accumulation when 0x0A010810 is absent.
  if (id == 0x9026105A && msg.data_length_code >= 6) {
    uint16_t odoRaw = (uint16_t)(msg.data[0] | (msg.data[1] << 8));
    uint8_t speedRaw = msg.data[5];

    atomicSpeed.store((int)speedRaw, std::memory_order_release);
    atomicOdometerKm.store((float)odoRaw, std::memory_order_release);

    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valSpeed = speedRaw;
      xSemaphoreGive(dataMutex);
    }

    return;
  }

  // Votol controller frame (0x90261022) - RPM, voltage, current
  if (id == 0x90261022 && msg.data_length_code >= 8) {
    uint16_t rpmRaw = (uint16_t)(msg.data[2] | (msg.data[3] << 8));
    uint16_t voltsRaw = (uint16_t)(msg.data[4] | (msg.data[5] << 8));
    int16_t ampsRaw = (int16_t)(msg.data[6] | (msg.data[7] << 8));

    int rpm = (int)rpmRaw;
    int speed = (int)round((float)rpm * 0.0783744f);

    atomicRPM.store(rpm, std::memory_order_release);
    atomicSpeed.store(speed, std::memory_order_release);

    float volts = voltsRaw / 100.0f;
    float amps = ampsRaw / 100.0f;
    float power = volts * amps;
    atomicVoltsRaw.store((int32_t)(volts * 10.0f), std::memory_order_release);
    atomicAmpereRaw.store((int32_t)(amps * 10.0f), std::memory_order_release);
    atomicPowerRaw.store((int32_t)power, std::memory_order_release);

    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valRPM = rpm;
      valSpeed = speed;
      valVolts = volts;
      valAmpere = amps;
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Battery temp sensors
  if (id == 0x0E6C0D09 && msg.data_length_code >= 5) {
     if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      int sum = 0;
      for (int i = 0; i < 5; i++) {
        valCellTemps[i] = msg.data[i];
        sum += (int)valCellTemps[i];
      }
      valBattTemp = sum / 5;
      xSemaphoreGive(dataMutex);
     }
    return;
  }

  // General info 1 (Voltage/Current/Capacity) - CRITICAL FOR REAL-TIME AMPERE
  if (id == 0x0A6D0D09 && msg.data_length_code >= 8) {
    // OPTIMIZATION: Decode and update Atomic variables IMMEDIATELY (No Mutex needed)
    uint16_t vRaw = (uint16_t)((msg.data[0] << 8) | msg.data[1]);
    float volts = vRaw * 0.1f;
    atomicVoltsRaw.store((int32_t)(volts * 10.0f), std::memory_order_release);

    uint16_t iRawU = (uint16_t)((msg.data[2] << 8) | msg.data[3]);
    int16_t iRawS = (int16_t)iRawU;
    float ampere = iRawS * 0.1f;
    atomicAmpereRaw.store((int32_t)(ampere * 10.0f), std::memory_order_release);

    float power = volts * ampere;
    atomicPowerRaw.store((int32_t)power, std::memory_order_release);

    // Update non-critical shared data with Mutex
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      if (fabs(ampere) < 0.2f) ampere = 0.0f; // Zero clamping for display
      valVolts = volts;
      valAmpere = ampere;
      valPower = power;
      rawVoltageHex = vRaw;
      rawCurrentHex = iRawU;

      uint16_t remainCap = (uint16_t)((msg.data[4] << 8) | msg.data[5]);
      valRemainingCapacity = remainCap * 0.1f;

      uint16_t fullCap = (uint16_t)((msg.data[6] << 8) | msg.data[7]);
      valFullCapacity = fullCap * 0.1f;
      
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Battery health
  if (id == 0x0A6E0D09 && msg.data_length_code >= 6) {
    // Mark data ready BEFORE mutex (atomic, lock-free)
    // This ensures flag is set even if mutex temporarily unavailable
    canDataReady.store(true, std::memory_order_release);
    
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      uint16_t socVal = (uint16_t)((msg.data[0] << 8) | msg.data[1]);
      rawSOCHex = socVal;

      valSOC = (int)getSoCFromLookup(socVal);
      if (valSOC > 100) valSOC = 100;
      if (valSOC < 0) valSOC = 0;

      uint16_t sohVal = (uint16_t)((msg.data[2] << 8) | msg.data[3]);
      valSOH = (int)(sohVal * 0.1f);
      if (valSOH > 100) valSOH = 100;

      valCycleCount = (uint16_t)((msg.data[4] << 8) | msg.data[5]);
      xSemaphoreGive(dataMutex);
    }
    return;
  }

