jagoanpilot/ESP32/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
  // Cell voltage stats
  if (id == 0x0A6F0D09 && msg.data_length_code >= 8) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valHighestCellVolt = (uint16_t)((msg.data[0] << 8) | msg.data[1]);
      valHighestCellNum  = msg.data[2];
      valLowestCellVolt  = (uint16_t)((msg.data[3] << 8) | msg.data[4]);
      valLowestCellNum   = msg.data[5];
      valAvgCellVolt     = (uint16_t)((msg.data[6] << 8) | msg.data[7]);
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Temp stats
  if (id == 0x0A700D09 && msg.data_length_code >= 6) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valMaxTemp = msg.data[0];
      valMaxTempCell = msg.data[1];
      valMinTemp = msg.data[4];
      valMinTempCell = msg.data[5];
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Balance status
  if (id == 0x0A730D09 && msg.data_length_code >= 6) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valBalanceMode = msg.data[0];
      valBalanceStatus = msg.data[1];
      valBalanceBits[0] = msg.data[2];
      valBalanceBits[1] = msg.data[3];
      valBalanceBits[2] = msg.data[4];
      valBalanceBits[3] = msg.data[5];

      snprintf(rawBalanceHexBuffer, sizeof(rawBalanceHexBuffer), "%02X %02X %02X %02X %02X %02X",
              msg.data[0], msg.data[1], msg.data[2], msg.data[3], msg.data[4], msg.data[5]);
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Cell volt blocks 0x0E64..0x0E69
  if ((id & 0xFFF0FFFF) == 0x0E600D09) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      int baseIndex = -1;
      switch (id) {
        case 0x0E640D09: baseIndex = 0;  break;
        case 0x0E650D09: baseIndex = 4;  break;
        case 0x0E660D09: baseIndex = 8;  break;
        case 0x0E670D09: baseIndex = 12; break;
        case 0x0E680D09: baseIndex = 16; break;
        case 0x0E690D09: baseIndex = 20; break;
        default: break;
      }
      if (baseIndex >= 0) {
        for (int i = 0; i < 4 && (baseIndex + i) < 23; i++) {
          int off = i * 2;
          if (off + 1 < msg.data_length_code) {
            valCells[baseIndex + i] = (uint16_t)((msg.data[off] << 8) | msg.data[off + 1]);
          }
        }
      }
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // External Charger Messages (Protokol Charger)
  // Was labeled CCS/China Charger Standard, but could be generic.
  if ((id == 0x1810D0F3 || id == 0x1811D0F3) && msg.data_length_code >= 5) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      uint16_t vRaw = (uint16_t)((msg.data[0] << 8) | msg.data[1]);
      valChargerVoltage = vRaw * 0.1f;

      uint16_t iRaw = (uint16_t)((msg.data[2] << 8) | msg.data[3]);
      valChargerCurrent = iRaw * 0.1f;

      valChargerStatus = msg.data[4];
      chargerConnected = true;
      lastChargerMsg = millis();
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // BMS Charging Flag (0x0AB40D09) - byte[0]=1 when charging
  if (id == 0x0AB40D09 && msg.data_length_code >= 1) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      bmsChargingFlag = (msg.data[0] == 0x01);
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // BMS Hardware Version (0x0A750D09) - ASCII "H:v21"
  if (id == 0x0A750D09 && msg.data_length_code >= 6) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      size_t copyLen = min((size_t)msg.data_length_code, sizeof(bmsHwVersion) - 1);
      memcpy(bmsHwVersion, msg.data, copyLen);
      bmsHwVersion[copyLen] = '\0';
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // BMS Firmware Version (0x0A760D09) - ASCII "F:v23"
  if (id == 0x0A760D09 && msg.data_length_code >= 6) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      size_t copyLen = min((size_t)msg.data_length_code, sizeof(bmsFwVersion) - 1);
      memcpy(bmsFwVersion, msg.data, copyLen);
      bmsFwVersion[copyLen] = '\0';
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // ORI Charger Detection (0x10261041) - only present with original charger
  // CRITICAL FIX: In NORMAL mode, ESP32 receives its own transmitted messages!
  // If we're in NORMAL mode, WE are the sender → ignore to prevent self-detection
  // which would set oriChargerDetected=true → oriTimeout=false → kill our own injector.
  // Only detect ORI charger in LISTEN_ONLY mode (we can't TX, so it must be real ORI).
  if (id == 0x10261041) {
    if (!currentTwaiModeNormal) {
      // We're in LISTEN_ONLY → this IS from ORI charger
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        oriChargerDetected = true;
        lastOriChargerMsg = millis();
        xSemaphoreGive(dataMutex);
      }
    }
    // else: In NORMAL mode → this is our own echo, ignore
    return;
  }



}

// Check if TWAI bus is healthy before transmitting
bool isCanBusHealthy() {
  twai_status_info_t status;
  if (twai_get_status_info(&status) != ESP_OK) return false;
  if (status.state == TWAI_STATE_BUS_OFF) {
    Serial.println("[CAN] BUS-OFF detected! Recovering...");
    twai_initiate_recovery();
    return false;
  }
  if (status.state == TWAI_STATE_RECOVERING) return false;
  return (status.state == TWAI_STATE_RUNNING);
}

// =============================================
// DYNAMIC TWAI MODE SWITCHER
// =============================================
// currentTwaiModeNormal is declared in global variables section above

void switchTwaiMode(bool normalMode) {
  if (currentTwaiModeNormal == normalMode) return; // Already in target mode

  // Stop and uninstall the current driver
  twai_stop();
  twai_driver_uninstall();

  // Re-install with new mode
  twai_mode_t newMode = normalMode ? TWAI_MODE_NORMAL : TWAI_MODE_LISTEN_ONLY;
  twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT(CAN_TX_PIN, CAN_RX_PIN, newMode);
  g_config.rx_queue_len = 50; // Use larger queue to prevent data loss 
  
  twai_timing_config_t t_config = TWAI_TIMING_CONFIG_250KBITS();
  twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

  if (twai_driver_install(&g_config, &t_config, &f_config) == ESP_OK) {
    if (twai_start() == ESP_OK) {
      currentTwaiModeNormal = normalMode;
      // Serial.printf("[CAN] Switched mode to %s\n", normalMode ? "NORMAL" : "LISTEN_ONLY");
    } else {
      Serial.println("[CAN] ERROR: Failed to start after mode switch!");
    }
  } else {
    Serial.println("[CAN] ERROR: Failed to install after mode switch!");
  }
}

// =============================================
// CAN INJECTOR (Simulate Original Charger)
// =============================================
// Caller must ensure TWAI is in NORMAL mode before calling.
// Mode management is handled by the CAN task loop.
void injectChargerMessage() {
  if (!currentTwaiModeNormal) return;
  
  twai_message_t tx_msg;
  memset(&tx_msg, 0, sizeof(tx_msg));
  tx_msg.identifier = 0x10261041;
  tx_msg.extd = 1;
  tx_msg.data_length_code = 8;
  tx_msg.data[0] = 0x05;
  tx_msg.data[1] = 0x0A;
  tx_msg.data[2] = 0x1C;

  esp_err_t result = twai_transmit(&tx_msg, pdMS_TO_TICKS(100));
  if (result != ESP_OK) {
    Serial.printf("[CAN-INJ] TX FAIL: 0x%x\n", result);
  }
}



// =============================================
// CAN TASK (Core 0 - High Priority)
// =============================================
void canTask(void *pvParameters) {
  
