jagoanpilot/ESP32/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
  twai_message_t message;
  bool gotMessage = false;
  static unsigned long lastInjectTime = 0;
  
  while (true) {
    gotMessage = false;
    
    // Drain CAN RX queue (Rate Limited) - Process as many as possible to avoid queue overflow
    while (twai_receive(&message, 0) == ESP_OK) {
      handleCANMessage(message);
      canMsgCount++;
      gotMessage = true;
    }

    // LED feedback
    if (gotMessage) {
      digitalWrite(LED_PIN, HIGH);
      lastLEDBlink = millis();
      ledState = true;
    } else if (ledState && (millis() - lastLEDBlink > 50)) {
      digitalWrite(LED_PIN, LOW);
      ledState = false;
    }

    // CAN rate per second
    uint32_t nowSec = millis() / 1000;
    if (nowSec != lastSecond) {
      canMessagesPerSec.store(canMsgCount, std::memory_order_release);
      canMsgCount = 0;
      lastSecond = nowSec;
    }

    // === HYBRID SOC SAVE STRATEGY ===
    // Reduces NVS writes from 17,280/day to ~3/day
    // Strategy 1: Periodic backup (every 1 hour when motor running)
    // Strategy 2: Shutdown save (CAN timeout = motor off)
    // Strategy 3: Shutdown handler save (esp_restart / clean shutdown)
    
    static unsigned long lastCanMessage = millis();  // Track last CAN activity
    
    // Update lastCanMessage if we got messages this loop
    if (gotMessage) {
      lastCanMessage = millis();
      shutdownSaved = false;  // Reset shutdown flag when motor active
      canDataReady.store(true, std::memory_order_release);
    }
    
    uint32_t canAge = millis() - lastCanMessage;
    bool motorRunning = (canAge < 5000);  // Motor running if CAN active within 5s

    if (canAge > 3000UL) {
      canDataReady.store(false, std::memory_order_release);
      valSOC = FORCED_BATTERY_PERCENT;
    }
    
    // SAVE STRATEGY #1: Shutdown Detection (CAN timeout)
    // Save once when motor turns off (30s no CAN = shutdown)
    if (canAge > CAN_TIMEOUT_MS && !shutdownSaved) {
      bool dataReady = canDataReady.load(std::memory_order_acquire);
      int currentSoc = 0;
      
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        currentSoc = valSOC;
        xSemaphoreGive(dataMutex);
      }
      
      if (dataReady && currentSoc >= 0 && currentSoc <= 100) {
        nvsWriteInt("soc", currentSoc);
        Serial.printf("[SOC-SAVE] Shutdown detected - SOC saved: %d%% (CAN inactive)\n", currentSoc);
        shutdownSaved = true;  // Prevent multiple saves
      }
    }
    
    // SAVE STRATEGY #2: Periodic Backup (every 1 hour when motor running)
    // Safety net in case of crash/unexpected shutdown
    if (motorRunning && millis() - lastPeriodicSave > SOC_PERIODIC_SAVE_MS) {
      bool dataReady = canDataReady.load(std::memory_order_acquire);
      int currentSoc = 0;
      
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        currentSoc = valSOC;
        xSemaphoreGive(dataMutex);
      }
      
      if (dataReady && currentSoc >= 0 && currentSoc <= 100) {
        nvsWriteInt("soc", currentSoc);
        Serial.printf("[SOC-SAVE] Periodic backup - SOC saved: %d%%\n", currentSoc);
        lastPeriodicSave = millis();
      }
    }


    // Snapshot shared variables ONCE under mutex for this iteration
    bool localChargerConnected = false;
    bool localOriChargerDetected = false;
    unsigned long localLastChargerMsg = 0;
    unsigned long localLastOriChargerMsg = 0;
    bool localBmsCharging = false;
    
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      localChargerConnected = chargerConnected;
      localOriChargerDetected = oriChargerDetected;
      localLastChargerMsg = lastChargerMsg;
      localLastOriChargerMsg = lastOriChargerMsg;
      localBmsCharging = bmsChargingFlag;
      xSemaphoreGive(dataMutex);
    }

    // Charger timeout - reset chargerConnected if no CAN message
    if (localChargerConnected && (millis() - localLastChargerMsg > CHARGER_TIMEOUT_MS)) {
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        chargerConnected = false;
        valChargerVoltage = 0.0f;
        valChargerCurrent = 0.0f;
        valChargerStatus = 0;
        xSemaphoreGive(dataMutex);
      }
      localChargerConnected = false; // Update local snapshot
    }

    // ORI Charger timeout - reset if no CAN message
    if (localOriChargerDetected && (millis() - localLastOriChargerMsg > ORI_CHARGER_TIMEOUT_MS)) {
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        oriChargerDetected = false;
        xSemaphoreGive(dataMutex);
      }
    }

    // Injector Logic for Third-Party Charger
    // FIX v2: Third-party chargers do NOT send CAN messages, so we can't rely on
    // chargerConnected flag. Instead detect charging via BMS charging flag + positive current.
    // 
    // From CAN sniff data:
    //   - Third-party charger: 0x0AB40D09 byte[0]=0x01 (BMS sees charging),
    //     current=4.2-4.3A, but mode stays PARK because no 0x10261041 injected.
    //   - ORI charger sends 0x10261041 itself, so injector must NOT interfere.
    //
    // Only inject if:
    // 1. Injector enabled by user
    // 2. BMS reports charging state (0x0AB40D09 byte[0]=1)
    // 3. ORI charger not detected (no 0x10261041 for >2s)
    // 4. Charging current is positive (>1A to filter noise/REGEN)
    //    OR external CAN charger is connected (chargerConnected flag)
    
    // Snapshot current ampere value under mutex
    float currentAmpere = 0.0f;
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      currentAmpere = valAmpere;
      xSemaphoreGive(dataMutex);
    }
    
    // Detect real charging: either CAN-connected charger OR BMS+current indicate charging
    bool canChargerActive = localChargerConnected && 
                            (millis() - localLastChargerMsg < CHARGER_TIMEOUT_MS);
    bool thirdPartyCharging = localBmsCharging && (currentAmpere > 1.0f);
    bool chargerActuallyActive = canChargerActive || thirdPartyCharging;
    
    // SAFETY: Only inject when vehicle is stationary.
    // This prevents false injection during REGEN braking where current is also positive.
    // Valid stationary modes: PARK(0x00), CHARGING(0x61), STAND(0x78/0x08)
    // Blocked modes: DRIVE, SPORT, REVERSE, BRAKE (vehicle is moving/decelerating)
    VehicleMode currentMode = atomicMode.load(std::memory_order_acquire);
    bool modeAllowsInjection = (currentMode == MODE_PARK || 
                                currentMode == MODE_CHARGING || 
                                currentMode == MODE_STAND);
    
