jagoanpilot/ESP32/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
    // READ-ONLY MODE:
    // Keep TWAI in LISTEN_ONLY for the BMS/CAN bus and do not inject any charger messages.
    // This avoids disrupting the battery/BMS CAN traffic while still allowing monitoring.
    bool shouldInject = false;
    (void)shouldInject;

    // Adaptive rate limiting: faster when driving, slower when charging
    // Driving: 50Hz (20ms) for responsive real-time data
    // Charging: 20Hz (50ms) to reduce CPU load during charger data flood
    // OTA Active: 5Hz (200ms) to prioritize flash writing
    if (isOtaInProgress()) {
      vTaskDelay(pdMS_TO_TICKS(200));
    } else {
      vTaskDelay(pdMS_TO_TICKS(localChargerConnected ? 50 : 20));
    }
  }
}

// Build FAST JSON - Critical real-time data only (~200-300 bytes)
static bool buildFastJson() {
  // Read atomic values (no mutex needed)
  int localRPM = atomicRPM.load(std::memory_order_acquire);
  int localSpeed = atomicSpeed.load(std::memory_order_acquire);
  float localAmpere = atomicAmpereRaw.load(std::memory_order_acquire) / 10.0f;
  float localVolts = atomicVoltsRaw.load(std::memory_order_acquire) / 10.0f;
  float localPower = (float)atomicPowerRaw.load(std::memory_order_acquire);
  VehicleMode localMode = atomicMode.load(std::memory_order_acquire);

  // Read other critical data under mutex
  int localSOC, localCtrlTemp, localMotorTemp, localBattTemp;

  uint32_t localCanRate;

  if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
    localSOC = valSOC;
    localCtrlTemp = valCtrlTemp;
    localMotorTemp = valMotorTemp;
    localBattTemp = valBattTemp;
    localCanRate = canMessagesPerSec.load(std::memory_order_acquire);

    xSemaphoreGive(dataMutex);
  } else {
    return false; // Skip if can't get mutex
  }

  // Build compact JSON with abbreviated field names
  int fastLen = snprintf(bleTxBuf, sizeof(bleTxBuf),
    "{\"r\":%d,"           // rpm
    "\"s\":%d,"           // speed
    "\"m\":\"%s\","       // mode
    "\"v\":%.1f,"         // volts
    "\"a\":%.1f,"         // amps
    "\"p\":%.0f,"         // power
    "\"sc\":%d,"          // soc
    "\"t\":{\"c\":%d,\"m\":%d,\"b\":%d},"  // temps: ctrl, motor, batt
    "\"cr\":%lu,"         // canRate
    "\"hb\":%lu,"         // heartbeat
    "\"inj\":%d,"         // injector enabled
    "\"type\":\"fast\""   // indicator for fast update
    "}\n",
    localRPM, localSpeed, getModeString(localMode),
    localVolts, localAmpere, localPower, localSOC,
    localCtrlTemp, localMotorTemp, localBattTemp,
    (unsigned long)localCanRate,
    (unsigned long)heartbeatCounter++,
    isInjectorEnabled.load(std::memory_order_acquire) ? 1 : 0
  );
  if (fastLen < 0) fastLen = 0;
  if ((size_t)fastLen >= sizeof(bleTxBuf)) {
    bleTxLen = sizeof(bleTxBuf) - 1;
  } else {
    bleTxLen = (uint16_t)fastLen;
  }
  return true;
}

// Build FULL JSON - Complete data including cells, balance, health (~1.5-2KB)
static bool buildFullJson() {
  // Read atomic values FIRST (no mutex needed, always fresh)
  int localRPM = atomicRPM.load(std::memory_order_acquire);
  int localSpeed = atomicSpeed.load(std::memory_order_acquire);
  float localAmpere = atomicAmpereRaw.load(std::memory_order_acquire) / 10.0f;
  float localVolts = atomicVoltsRaw.load(std::memory_order_acquire) / 10.0f;
  float localPower = (float)atomicPowerRaw.load(std::memory_order_acquire);
  VehicleMode localMode = atomicMode.load(std::memory_order_acquire);

  // Local copies for thread safety (non-critical data)
  int localSOC, localCtrlTemp, localMotorTemp, localBattTemp;
  int localSOH, localCycleCount;
  float localRemainingCap, localFullCap;
  uint16_t localCells[23];
  uint16_t localHighestVolt, localLowestVolt, localAvgVolt;
  uint8_t localHighestNum, localLowestNum;
  uint8_t localMaxTemp, localMaxTempCell, localMinTemp, localMinTempCell;
  uint8_t localBalanceMode, localBalanceStatus, localBalanceBits[4];
  float localChargerVolt, localChargerCurrent;
  // localChargerStatus removed - unused
  bool localChargerConnected;
  unsigned long localLastChargerMsg;
  uint32_t localCanRate;
  // localRawCurrent, localRawVoltage, localRawSOC removed - unused in output
  // New BMS info
  bool localBmsChargingFlag;
  bool localOriCharger;
  unsigned long localLastOriChargerMsg;
  char localHwVersion[8];
  char localFwVersion[8];


  // Read non-critical data under mutex (short hold time)
  if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
    localSOC = valSOC;
    localCtrlTemp = valCtrlTemp;
    localMotorTemp = valMotorTemp;
    localBattTemp = valBattTemp;
    localSOH = valSOH;
    localCycleCount = valCycleCount;
    localRemainingCap = valRemainingCapacity;
    localFullCap = valFullCapacity;
    localHighestVolt = valHighestCellVolt;
    localHighestNum = valHighestCellNum;
    localLowestVolt = valLowestCellVolt;
    localLowestNum = valLowestCellNum;
    localAvgVolt = valAvgCellVolt;
    localMaxTemp = valMaxTemp;
    localMaxTempCell = valMaxTempCell;
    localMinTemp = valMinTemp;
    localMinTempCell = valMinTempCell;
    localBalanceMode = valBalanceMode;
    localBalanceStatus = valBalanceStatus;
    memcpy(localBalanceBits, valBalanceBits, 4);
    localChargerVolt = valChargerVoltage;
    localChargerCurrent = valChargerCurrent;
    // localChargerStatus not used in JSON output
    localChargerConnected = chargerConnected;
    localLastChargerMsg = lastChargerMsg;
    localCanRate = canMessagesPerSec.load(std::memory_order_acquire);
    // rawCurrentHex, rawVoltageHex, rawSOCHex not used in JSON output
    memcpy(localCells, valCells, sizeof(localCells));
    // New BMS info
    localBmsChargingFlag = bmsChargingFlag;
    localOriCharger = oriChargerDetected;
    localLastOriChargerMsg = lastOriChargerMsg;
    strcpy(localHwVersion, bmsHwVersion);
    strcpy(localFwVersion, bmsFwVersion);

    xSemaphoreGive(dataMutex);
  } else {
    // Fallback - use last known values
    return false;
  }

  // Note: Atomic values (RPM, speed, ampere, volts, power, mode) already read above

  // Calculate cell delta
  uint16_t minCell = 9999, maxCell = 0;
  for (int i = 0; i < 23; i++) {
    if (localCells[i] > 0 && localCells[i] < minCell) minCell = localCells[i];
    if (localCells[i] > maxCell) maxCell = localCells[i];
  }
  int cellDelta = (minCell > maxCell) ? 0 : ((int)maxCell - (int)minCell);

  // Build balance cells array string (compact: 0/1 instead of true/false)
  // 23 cells * 1 digit + 22 commas + null = 46 bytes, use 64 for safety
  char balanceCells[64];
  int bpos = 0;
  for (int i = 0; i < 23; i++) {
    int byteIndex = i / 8;
    int bitIndex = i % 8;
    bool isBalancing = (localBalanceBits[byteIndex] & (1 << bitIndex)) != 0;
    int written = snprintf(balanceCells + bpos, sizeof(balanceCells) - bpos, 
                     "%d%s", isBalancing ? 1 : 0, (i < 22) ? "," : "");
    if (written > 0) bpos += written;
  }

  // Build cells array string
  // 23 cells * max 5 digits (65535) + 22 commas + null = 138 bytes, use 160 for safety
  char cellsStr[160];
  int cpos = 0;
  for (int i = 0; i < 23; i++) {
    int written = snprintf(cellsStr + cpos, sizeof(cellsStr) - cpos, 
                     "%u%s", localCells[i], (i < 22) ? "," : "");
    if (written > 0) cpos += written;
  }

  // Build complete JSON with abbreviated field names
  int fullLen = snprintf(bleTxBuf, sizeof(bleTxBuf),
    "{\"r\":%d,"
    "\"s\":%d,"
    "\"m\":\"%s\","
    "\"v\":%.1f,"
    "\"a\":%.1f,"
    "\"p\":%.0f,"
    "\"sc\":%d,"
    "\"t\":{\"c\":%d,\"m\":%d,\"b\":%d},"
    "\"cells\":[%s],"
    "\"cd\":%d,"
    "\"cr\":%lu,"
    "\"h\":{\"soh\":%d,\"cyc\":%u,\"rc\":%.1f,\"fc\":%.1f},"
    "\"cvs\":{\"hi\":%u,\"hiC\":%u,\"lo\":%u,\"loC\":%u,\"av\":%u},"
    "\"ts\":{\"max\":%u,\"maxC\":%u,\"min\":%u,\"minC\":%u},"
    "\"b\":{\"md\":%u,\"st\":%u,\"cells\":[%s]},"
    "\"chr\":{\"on\":%d,\"v\":%.1f,\"a\":%.1f,\"ori\":%d},"
    "\"bms\":{\"hw\":\"%s\",\"fw\":\"%s\"},"
    "\"hb\":%lu,"
    "\"inj\":%d,"
    "\"type\":\"full\""
    "}\n",
    localRPM, localSpeed, getModeString(localMode),
    localVolts, localAmpere, localPower, localSOC,
    localCtrlTemp, localMotorTemp, localBattTemp,
    cellsStr, cellDelta,
    (unsigned long)localCanRate,
    localSOH, localCycleCount, localRemainingCap, localFullCap,
    localHighestVolt, localHighestNum, localLowestVolt, localLowestNum, localAvgVolt,
    localMaxTemp, localMaxTempCell, localMinTemp, localMinTempCell,
    localBalanceMode, localBalanceStatus, balanceCells,
    localBmsChargingFlag ? 1 : 0,  // charger.on = 0/1
    (localChargerVolt > 0.1f) ? localChargerVolt : localVolts,      // Fallback to system volts
    (localChargerCurrent > 0.1f) ? localChargerCurrent : fabs(localAmpere), // Fallback to system amps
    (millis() - localLastOriChargerMsg < ORI_CHARGER_TIMEOUT_MS && localOriCharger) ? 1 : 0,  // charger.ori = 0/1
    localHwVersion, localFwVersion,
    (unsigned long)heartbeatCounter++,
    isInjectorEnabled.load(std::memory_order_acquire) ? 1 : 0
  );
  if (fullLen < 0) fullLen = 0;
  if ((size_t)fullLen >= sizeof(bleTxBuf)) {
    bleTxLen = sizeof(bleTxBuf) - 1;
  } else {
    bleTxLen = (uint16_t)fullLen;
  }
  return true;
}

// Build a compact full-state snapshot that fits in a single characteristic read.
// This keeps Web Bluetooth stable without changing the notify stream used by Android.
static void updateWebSnapshotValue() {
  if (pWebSnapshotCharacteristic == nullptr) return;
  if (!deviceConnected.load(std::memory_order_acquire)) return;

