jagoanpilot/ESP32/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
  int localRPM = atomicRPM.load(std::memory_order_acquire);
  int localSpeed = atomicSpeed.load(std::memory_order_acquire);
  float localAmpere = atomicAmpereRaw.load(std::memory_order_acquire) / 10.0f;
  float localVolts = atomicVoltsRaw.load(std::memory_order_acquire) / 10.0f;
  float localPower = (float)atomicPowerRaw.load(std::memory_order_acquire);
  VehicleMode localMode = atomicMode.load(std::memory_order_acquire);

  int localSOC, localCtrlTemp, localMotorTemp, localBattTemp;
  int localSOH, localCycleCount;
  float localRemainingCap, localFullCap;
  uint16_t localCells[23];
  uint16_t localHighestVolt, localLowestVolt, localAvgVolt;
  uint8_t localHighestNum, localLowestNum;
  uint8_t localBalanceMode, localBalanceStatus, localBalanceBits[4];
  float localChargerVolt, localChargerCurrent;
  bool localBmsChargingFlag;
  bool localOriCharger;
  unsigned long localLastOriChargerMsg;
  uint32_t localCanRate;

  if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(10)) != pdTRUE) return;

  localSOC = valSOC;
  localCtrlTemp = valCtrlTemp;
  localMotorTemp = valMotorTemp;
  localBattTemp = valBattTemp;
  localSOH = valSOH;
  localCycleCount = valCycleCount;
  localRemainingCap = valRemainingCapacity;
  localFullCap = valFullCapacity;
  localHighestVolt = valHighestCellVolt;
  localHighestNum = valHighestCellNum;
  localLowestVolt = valLowestCellVolt;
  localLowestNum = valLowestCellNum;
  localAvgVolt = valAvgCellVolt;
  localBalanceMode = valBalanceMode;
  localBalanceStatus = valBalanceStatus;
  memcpy(localBalanceBits, valBalanceBits, sizeof(localBalanceBits));
  memcpy(localCells, valCells, sizeof(localCells));
  localChargerVolt = valChargerVoltage;
  localChargerCurrent = valChargerCurrent;
  localBmsChargingFlag = bmsChargingFlag;
  localOriCharger = oriChargerDetected;
  localLastOriChargerMsg = lastOriChargerMsg;
  localCanRate = canMessagesPerSec.load(std::memory_order_acquire);

  xSemaphoreGive(dataMutex);

  uint16_t minCell = 9999, maxCell = 0;
  for (int i = 0; i < 23; i++) {
    if (localCells[i] > 0 && localCells[i] < minCell) minCell = localCells[i];
    if (localCells[i] > maxCell) maxCell = localCells[i];
  }
  int cellDelta = (minCell > maxCell) ? 0 : ((int)maxCell - (int)minCell);

  char balanceCells[64];
  int bpos = 0;
  for (int i = 0; i < 23; i++) {
    int byteIndex = i / 8;
    int bitIndex = i % 8;
    bool isBalancing = (localBalanceBits[byteIndex] & (1 << bitIndex)) != 0;
    int written = snprintf(
      balanceCells + bpos,
      sizeof(balanceCells) - bpos,
      "%d%s",
      isBalancing ? 1 : 0,
      (i < 22) ? "," : ""
    );
    if (written > 0) bpos += written;
  }

  char cellsStr[160];
  int cpos = 0;
  for (int i = 0; i < 23; i++) {
    int written = snprintf(
      cellsStr + cpos,
      sizeof(cellsStr) - cpos,
      "%u%s",
      localCells[i],
      (i < 22) ? "," : ""
    );
    if (written > 0) cpos += written;
  }

  int snapshotLen = snprintf(
    webSnapshotBuf,
    sizeof(webSnapshotBuf),
    "{\"r\":%d,"
    "\"s\":%d,"
    "\"m\":\"%s\","
    "\"v\":%.1f,"
    "\"a\":%.1f,"
    "\"p\":%.0f,"
    "\"sc\":%d,"
    "\"t\":{\"c\":%d,\"m\":%d,\"b\":%d},"
    "\"cells\":[%s],"
    "\"cd\":%d,"
    "\"cr\":%lu,"
    "\"h\":{\"soh\":%d,\"cyc\":%u,\"rc\":%.1f,\"fc\":%.1f},"
    "\"cvs\":{\"hi\":%u,\"hiC\":%u,\"lo\":%u,\"loC\":%u,\"av\":%u,\"delta\":%d},"
    "\"b\":{\"md\":%u,\"st\":%u,\"cells\":[%s]},"
    "\"chr\":{\"on\":%d,\"v\":%.1f,\"a\":%.1f,\"ori\":%d},"
    "\"hb\":%lu,"
    "\"inj\":%d,"
    "\"type\":\"full\""
    "}\n",
    localRPM, localSpeed, getModeString(localMode),
    localVolts, localAmpere, localPower, localSOC,
    localCtrlTemp, localMotorTemp, localBattTemp,
    cellsStr, cellDelta,
    (unsigned long)localCanRate,
    localSOH, localCycleCount, localRemainingCap, localFullCap,
    localHighestVolt, localHighestNum, localLowestVolt, localLowestNum, localAvgVolt, cellDelta,
    localBalanceMode, localBalanceStatus, balanceCells,
    localBmsChargingFlag ? 1 : 0,
    (localChargerVolt > 0.1f) ? localChargerVolt : localVolts,
    (localChargerCurrent > 0.1f) ? localChargerCurrent : fabs(localAmpere),
    (millis() - localLastOriChargerMsg < ORI_CHARGER_TIMEOUT_MS && localOriCharger) ? 1 : 0,
    (unsigned long)heartbeatCounter,
    isInjectorEnabled.load(std::memory_order_acquire) ? 1 : 0
  );

  if (snapshotLen <= 0 || (size_t)snapshotLen >= sizeof(webSnapshotBuf)) {
    Serial.printf("[BLE] Web snapshot too large or invalid: %d bytes\n", snapshotLen);
    return;
  }

  pWebSnapshotCharacteristic->setValue((uint8_t*)webSnapshotBuf, snapshotLen);
}

static void startBleTxIfIdle(bool useFast) {
  if (!deviceConnected.load(std::memory_order_acquire)) return;
  if (bleTxInProgress) return;

  bool ok;
  if (useFast) {
    ok = buildFastJson();
  } else {
    ok = buildFullJson();
  }
  
  if (!ok) return; // SKIP jika build gagal, jangan kirim data stale

  const uint32_t now = millis();
  if (!useFast || (now - lastWebSnapshotRefresh) >= getWebSnapshotInterval()) {
    updateWebSnapshotValue();
    lastWebSnapshotRefresh = now;
  }
  
  bleTxOffset = 0;
  bleTxInProgress = true;
}

static void pumpBleTx() {
  if (!deviceConnected.load(std::memory_order_acquire)) {
    bleTxInProgress = false;
    bleTxOffset = 0;
    return;
  }
  if (!bleTxInProgress) return;

  if (bleTxOffset >= bleTxLen) {
    bleTxInProgress = false;
    return;
  }

  const uint32_t startUs = micros();
  int sent = 0;

  while (bleTxInProgress &&
         sent < BLE_PUMP_MAX_CHUNKS &&
         (micros() - startUs) < BLE_PUMP_BUDGET_US) {

    int remain = bleTxLen - (int)bleTxOffset;
    if (remain <= 0) {
      bleTxInProgress = false;
      break;
    }

    int chunkLen = min((int)BLE_SAFE_CHUNK, remain);
    const char *p = bleTxBuf + bleTxOffset;

    pCharacteristic->setValue((uint8_t*)p, chunkLen);
    pCharacteristic->notify();

    bleTxOffset += chunkLen;
    sent++;
  }

  if (bleTxOffset >= bleTxLen) bleTxInProgress = false;
}

// =============================================
// ADAPTIVE TIMING HELPERS
// =============================================
static uint32_t getFastUpdateInterval() {
  // Read current mode from atomic (no mutex needed)
  VehicleMode mode = atomicMode.load(std::memory_order_acquire);

